# IsOverriddenParameterModifiable Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerParameterManager..::..IsOverriddenParameterModifiable Method
RebarContainerParameterManager Class See Also
---
Checks if overridden parameter is modifiable.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsOverriddenParameterModifiable(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Function IsOverriddenParameterModifiable ( _
	paramId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsOverriddenParameterModifiable(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Overridden parameter id
# ### Return Value
True if the parameter is modifiable, false if the parameter is readonly.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | paramId has no override |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace